In [2]:
import pandas as pd

students    = pd.read_json('data/students.json')
courses     = pd.read_json('data/courses.json')
enrollments = pd.read_json('data/enrollments.json')
enrollments_per_course = pd.read_json('data/enrollments_per_course.json')

In [3]:
enrollments.head()

   studentsID  coursesID
0          30          3
1          30         15
2          33          7
3          33          7
4          33         14

In [4]:
enrollments_per_course.head()

   number of students           courses_name
1                   3  Lógica de programação
2                   3          Java para Web
3                   9            C# para Web
4                   1          Ruby on Rails
5                   6       Cursos de Python

In [5]:
course_id = 5
next_class = enrollments.query(f'coursesID == {course_id}')
next_class

    studentsID  coursesID
7           23          5
18          28          5
28           9          5
29          37          5
73          17          5
88          15          5

In [6]:
next_class = next_class.set_index('studentsID').join(students.set_index('studentsID'))['nome'].to_frame()

In [7]:
course_name = courses.loc[course_id]
course_name = course_name[0]

In [8]:
next_class.rename(columns={'nome': f'{course_name} course students'})

           Cursos de Python course students
studentsID
23                                FRANCISCA
28                                 FERNANDA
9                                    CAMILA
37                                   AMANDA
17                                    BRUNO
15                                  RODRIGO

## Importing

In [9]:
next_class.to_excel('data/next_class.xlsx', index = False)